In [1]:
import pandas as pd
import numpy as np

# DataFrames

In [3]:
#Let's create some data

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [3]:
df = pd.DataFrame(data,columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Series

In [8]:
df[['Make','Model','MSRP']]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [9]:
# Adding new columns:

df['id'] = [1,2,3,4,5]

In [25]:
df

,id,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,1,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,3,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,4,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,5,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [24]:
# Changing columns position:

df.insert(0,'id',df.pop('id'))

# Accessing Elements

In [33]:
df.loc[4]

id                          5
Make                   Nissan
Model                Frontier
Year                     2017
Engine HP               261.0
Engine Cylinders            6
Transmission Type      MANUAL
Vehicle_Style          Pickup
MSRP                    32340
Name: 4, dtype: object

In [34]:
df.loc[[1,3]]

,id,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,4,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

# Element-wise operations

In [38]:
df['Engine HP'] ** 2

0    19044.0
1        NaN
2    47524.0
3    37636.0
4    68121.0
Name: Engine HP, dtype: float64

# Filtering

In [41]:
df[df['Year'] >= 2015]

,id,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,4,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,5,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [47]:
df[
    (df['Year'] >= 2017) & (df['Transmission Type'] == 'AUTOMATIC')
]

,id,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,4,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

# String Operations

In [48]:
df['Vehicle_Style'].str.lower()

0          sedan
1          sedan
2    convertible
3        4dr suv
4         pickup
Name: Vehicle_Style, dtype: object

In [50]:
df.columns = df.columns.str.replace(' ','_')

In [51]:
df

,id,Make,Model,Year,Engine_HP,Engine_Cylinders,Transmission_Type,Vehicle_Style,MSRP
0,1,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,3,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,4,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,5,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Summarizing Operations

In [55]:
df.describe().round(2)

         id     Year  Engine_HP  Engine_Cylinders      MSRP
count  5.00     5.00       4.00              5.00      5.00
mean   3.00  2010.40     202.75              4.40  30186.00
std    1.58    11.26      51.30              0.89  18985.04
min    1.00  1991.00     138.00              4.00   2000.00
25%    2.00  2010.00     180.00              4.00  27150.00
50%    3.00  2017.00     206.00              4.00  32340.00
75%    4.00  2017.00     228.75              4.00  34450.00
max    5.00  2017.00     261.00              6.00  54990.00

In [57]:
# Categorical columns:

df.nunique()

id                   5
Make                 4
Model                5
Year                 3
Engine_HP            4
Engine_Cylinders     2
Transmission_Type    2
Vehicle_Style        5
MSRP                 5
dtype: int64

# Missing Values

In [59]:
df.isnull().sum()

id                   0
Make                 0
Model                0
Year                 0
Engine_HP            1
Engine_Cylinders     0
Transmission_Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

In [60]:
df

,id,Make,Model,Year,Engine_HP,Engine_Cylinders,Transmission_Type,Vehicle_Style,MSRP
0,1,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,3,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,4,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,5,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Grouping

In [63]:
df.groupby(['Transmission_Type','Make']).agg({'MSRP':'mean'}).round(2)

                              MSRP
Transmission_Type Make
AUTOMATIC         GMC      34450.0
                  Hyundai  27150.0
MANUAL            Lotus    54990.0
                  Nissan   17170.0

# Getting Numpy Arrays

In [66]:
df.Year.values

array([1991, 2017, 2010, 2017, 2017])